Documents/ESB/ESB_Consumer_1016/003TestSample/SAMPLE_XML_MUST/DepositAccount/DA17_PreDsgntdLmtModRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/DepositAccount/PreDsgntdLmtModRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>DepositAccount</ServiceDomain>  
      <OperationName>PreDsgntdLmtMod</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:PreDsgntdLmtModRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>DA17</v11:TxnId>  
        <v11:TxnNo>DA1700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:CustPermId>A123456789</v11:CustPermId>  
        <v11:AcctNo>0001200001000200</v11:AcctNo>  
        <v11:ChanId>APP</v11:ChanId>  
        <v11:PDLmtAmt>5000000</v11:PDLmtAmt>  
        <v11:UpdtUserId>USER001</v11:UpdtUserId>  
        <v11:UpdtBrchId>9999</v11:UpdtBrchId> 
      </v11:ServiceBody> 
    </v11:PreDsgntdLmtModRq> 
  </soap:Body> 
</soap:Envelope>
